tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'git'
brew 'git-extras'
brew 'hub'
brew 'ag'
brew 'jq'
brew 'fzf'
brew 'tmux'
brew 'tig'
brew 'curl'
brew 'nmap'
brew 'tcpdump'
brew 'entr'
brew 'gawk'
brew 'htop'
brew 'midnight-commander'
brew 'ncdu'
brew 'rsync'
brew 'tldr'
brew 'zsh'
brew 'iterm2'
brew 'nvm'
brew 'pandoc'

brew 'vim', args: ['with-python3', 'with-lua', 'with-luajit']
brew 'neovim'

brew 'haskell-stack'

brew 'mas'
cask 'spotify'
cask 'vlc'


cask 'dash'
cask 'alfred'
cask 'docker'
cask 'owncloud'
cask 'colorpicker-skalacolor'
cask 'appcleaner'
cask 'franz'

cask 'visual-studio-code'
cask 'mailmate'

mas 'Affinity Photo', id: 824183456
mas 'Affinity Designe', id: 824171161
mas 'Xcode', id: 497799835
mas 'Helium', id: 1054607607
mas 'Tweetbot', id: 1384080005
mas 'Keka', id: 470158793
mas 'Marked 2', id: 890031187
mas 'Reeder', id: 880001334


